In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "HeroesOfPymoli_data.csv"

In [2]:
# Read Purchasing File and store into Pandas data frame
purchase_df = pd.read_csv(file_to_load)
purchase_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
player_df = purchase_df.groupby("SN")["SN"].nunique()
player_df.count()

576

In [4]:
purchase_count_df = pd.DataFrame({"Total Players": [player_df.count()]})
purchase_count_df

   Total Players
0            576

In [5]:
purchase_df.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [6]:
itemsID_df = purchase_df.groupby("Item ID")["Item ID"].nunique()
itemsID_df.count()

183

In [7]:
avg_price_df = round(purchase_df["Price"].mean(), 2)
avg_price_df

3.05

In [8]:
num_of_purchases_df = len(purchase_df)
num_of_purchases_df

780

In [9]:
total_revuenue_df = purchase_df["Price"].sum()
total_revuenue_df

2379.77

In [10]:
purchasing_analysis_df = pd.DataFrame({"Number of Unique Items": [itemsID_df.count()],
                                             "Average Purchase Price": [avg_price_df],
                                            "Total Number of Purchases":[num_of_purchases_df],
                                             "Total Revenue":[total_revuenue_df]})


purchasing_analysis_df = purchasing_analysis_df.round(2)
purchasing_analysis_df ["Average Purchase Price"] = purchasing_analysis_df["Average Purchase Price"].map("${:,.2f}".format)
purchasing_analysis_df ["Total Revenue"] = purchasing_analysis_df["Total Revenue"].map("${:,.2f}".format)
purchasing_analysis_df = purchasing_analysis_df.loc[:, ["Number of Unique Items", "Average Purchase Price", "Total Number of Purchases", "Total Revenue"]]
purchasing_analysis_df

,Number of Unique Items,Average Purchase Price,Total Number of Purchases,Total Revenue
0,183,$3.05,780,"$2,379.77"

In [11]:
gender_count_df = purchase_df.groupby("Gender")["SN"].nunique()
gender_count_df.head()

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [12]:
gender_percentage_df = gender_count_df/576
gender_percentage_df = gender_percentage_df * 100
gender_percentage_df.round(2)

Gender
Female                   14.06
Male                     84.03
Other / Non-Disclosed     1.91
Name: SN, dtype: float64

In [13]:
gender_demo_df = pd.DataFrame({"Gender Count": gender_count_df,"Gender Percentage": gender_percentage_df.round(2).astype(str) + '%'})
gender_demo_df

                       Gender Count Gender Percentage
Gender
Female                           81            14.06%
Male                            484            84.03%
Other / Non-Disclosed            11             1.91%

In [14]:
gender_purchases_df = purchase_df.groupby("Gender")["Item Name"]
gender_purchases_df.count()

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Item Name, dtype: int64

In [15]:
gender_average_df = purchase_df.groupby("Gender")["Price"].mean()
gender_average_df.round(2)

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

In [16]:
gender_total_df = purchase_df.groupby("Gender")["Price"].sum()
gender_total_df

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [17]:
normalized_total_df = gender_total_df/gender_count_df
normalized_total_df.round(2)

Gender
Female                   4.47
Male                     4.07
Other / Non-Disclosed    4.56
dtype: float64

In [18]:
gender_analysis_df = pd.DataFrame({"Purchase Count":gender_purchases_df.count(), 
                                   "Average Purchase Price":gender_average_df.round(2),
                                   "Total Purchase Value":gender_total_df,
                                   "Normalized Totals":normalized_total_df.round(2)})

gender_analysis_df = gender_analysis_df.round(2)
gender_analysis_df ["Average Purchase Price"] = gender_analysis_df["Average Purchase Price"].map("${:,.2f}".format)
gender_analysis_df ["Total Purchase Value"] = gender_analysis_df["Total Purchase Value"].map("${:,.2f}".format)
gender_analysis_df ["Normalized Totals"] = gender_analysis_df["Normalized Totals"].map("${:,.2f}".format)
gender_analysis_df = gender_analysis_df.loc[:, ["Purchase Count", "Average Purchase Price", "Total Purchase Value", "Normalized Totals"]]

gender_analysis_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Normalized Totals
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

In [66]:
bins = [0, 10, 15, 20, 25, 30, 35, 40, 45]
age_range = ["<10", "10-14","15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

purchase_df["Age Range"] = pd.cut(purchase_df["Age"], bins, labels= age_range)
purchase_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35-39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [105]:
age_group_df = purchase_df.groupby("Age Range")
total_count_group_df = age_group_df["SN"].nunique()

In [106]:
percent_age_df = (total_count_group_df/576) * 100

In [109]:
age_demographic = pd.DataFrame({"Total Count": total_count_group_df, "Percentage of Players": percent_age_df})

age_demographic ["Percentage of Players"] = age_demographic["Percentage of Players"].map("{:,.2f}%".format)
age_demographic = age_demographic.loc[:, ["Total Count", "Percentage of Players"]]

age_demographic

           Total Count Percentage of Players
Age Range
<10                 24                 4.17%
10-14               41                 7.12%
15-19              150                26.04%
20-24              232                40.28%
25-29               59                10.24%
30-34               37                 6.42%
35-39               26                 4.51%
40+                  7                 1.22%

In [111]:
players_purchase_count_df = purchase_df.groupby("SN").count()["Price"].rename("Purchase Count")
players_average_price_df = purchase_df.groupby("SN").mean()["Price"].rename("Average Purchase Price")
players_total_df = purchase_df.groupby("SN").sum()["Price"].rename("Total Purchase Value")



total_user_data_df = pd.DataFrame({"Purchase Count":players_purchase_count_df,
                                   "Average Purchase Price": players_average_price_df,
                                   "Total Purchase Value": players_total_df})
total_user_data_df.head()

              Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76               1                    2.28                  2.28
Adastirin33                1                    4.48                  4.48
Aeda94                     1                    4.91                  4.91
Aela59                     1                    4.32                  4.32
Aelaria33                  1                    1.79                  1.79

In [112]:
top_five_spenders = total_user_data_df.sort_values("Total Purchase Value", ascending=False)
top_five_spenders.head()

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [115]:
items_purchase_count_df = purchase_df.groupby(["Item ID", "Item Name"]).count()["Price"].rename("Purchase Count")
items_avg_price_df = purchase_df.groupby(["Item ID", "Item Name"]).mean()["Price"].rename("Average Purchase Price")
items_value_total_df = purchase_df.groupby(["Item ID", "Item Name"]).sum()["Price"].rename("Total Purchase Value")


items_purchased_df = pd.DataFrame({"Purchase Count":items_purchase_count_df,
                                   "Item Price":items_average_price_df,
                                   "Total Purchase Value":items_value_total_df,})

items_purchased_df.head()

                            Purchase Count  Item Price  Total Purchase Value
Item ID Item Name
0       Splinter                         4        1.28                  5.12
1       Crucifer                         3        3.26                  9.78
2       Verdict                          6        2.48                 14.88
3       Phantomlight                     6        2.49                 14.94
4       Bloodlord's Fetish               5        1.70                  8.50

In [116]:
most_popular_items_df = items_purchased_df.sort_values("Purchase Count", ascending=False)
most_popular_items_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

In [117]:
most_profitable_items_df = items_purchased_df.sort_values("Total Purchase Value", ascending=False)
most_profitable_items_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80